"""
Написать декоратор instances_counter, который применяется к любому классу
и добавляет ему 2 метода:
get_created_instances - возвращает количество созданых экземпляров класса
reset_instances_counter - сбросить счетчик экземпляров,
возвращает значение до сброса
Имя декоратора и методов не менять

Ниже пример использования
"""


def instances_counter(cls):
    """Some code"""
    _counter = 0

    def __new__(cls, *args, **kwargs):
        nonlocal _counter
        instance = super(cls, cls).__new__(cls)
        _counter += 1
        return instance

    def get_created_instances(instance=None):
        return _counter

    def reset_instances_counter(instance=None):
        nonlocal _counter
        return_value = _counter
        _counter = 0
        return return_value

    setattr(cls, "__new__", __new__)
    setattr(cls, "get_created_instances", get_created_instances)
    setattr(cls, "reset_instances_counter", reset_instances_counter)

    return cls


@instances_counter
class User:
    pass


if __name__ == "__main__":
    print(User.get_created_instances())  # 0
    user, _, _ = User(), User(), User()
    print(user.get_created_instances())  # 3
    print(user.reset_instances_counter())  # 3
    print(user.reset_instances_counter())
